Machine Learning Zoomcamp
1.9 Introduction to Pandas
Plan:

Data Frames
Series
Index
Accessing elements
Element-wise operations
Filtering
String operations
Summarizing operations
Missing values
Grouping
Getting the NumPy arrays

In [2]:
import pandas as pd
import numpy as np

Data Frames

In [4]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [15]:
df = pd.DataFrame(data,columns=columns) # Create a DataFrame using the data and columns lists
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [14]:
df.head() # shows the first 5 rows of the data frame

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [18]:
df.Make # shows the column 'Make' also can use df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [20]:
df[['Make','Model','Year']] # shows the columns 'Make','Model','Year'

      Make     Model  Year
0   Nissan    Stanza  1991
1  Hyundai    Sonata  2017
2    Lotus     Elise  2010
3      GMC    Acadia  2017
4   Nissan  Frontier  2017

In [25]:
df['id'] = np.array([1,2,3,4,5]) # add a new column 'id' to the data frame
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [29]:
df.index # shows the index of the data frame

RangeIndex(start=0, stop=5, step=1)

In [32]:
df.Make.index # shows the index of the column 'Make'

RangeIndex(start=0, stop=5, step=1)

In [35]:
df.loc[3] # shows the row with index 3 df.loc[[3,4]] shows the rows with index 3 and 4

Make                       GMC
Model                   Acadia
Year                      2017
Engine HP                194.0
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style          4dr SUV
MSRP                     34450
id                           4
Name: 3, dtype: object

In [38]:
df.index = ['a','b','c','d','e'] # change the index of the data frame
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [40]:
df.iloc[3] # shows the row with index 3 df.iloc[[3,4]] shows the rows with index 3 and 4 
# using iloc method which uses the integer index of the rows and columns to access the data in the data frame

Make                       GMC
Model                   Acadia
Year                      2017
Engine HP                194.0
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style          4dr SUV
MSRP                     34450
id                           4
Name: d, dtype: object

In [43]:
df.reset_index() # reset the index of the data frame to the default integer index and the old index is added as a new column

,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [45]:
df.reset_index(drop=True) # reset the index of the data frame to the default integer index and the old index is dropped

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

Element-wise operations

In [49]:
df['Engine HP']/100 * 2 # multiply the values of the column 'Engine HP' by 2

a    2.76
b     NaN
c    4.36
d    3.88
e    5.22
Name: Engine HP, dtype: float64

In [51]:

ndf = df[
    df['Year'] >= 2015
]
ndf # shows the rows where the value of the column 'Year' is greater than or equal to 2015

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [53]:
df[
    (df['Year'] >= 2015) & (df['Make'] == 'Nissan')
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

String operatins

In [60]:
'STR'.lower() # convert the string to lower case

'str'

In [62]:
'machine learning zoomcamp'.replace(' ','_') # replace the space with underscore

'machine_learning_zoomcamp'

In [63]:
df['Vehicle_Style'].str.lower() # convert the values of the column 'Vehicle_Style' to lower case

a          sedan
b          sedan
c    convertible
d        4dr suv
e         pickup
Name: Vehicle_Style, dtype: object

In [67]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.replace(' ','_') # replace the space with underscore in the values of the column 'Vehicle_Style'
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

Summarizing operations

In [69]:
df.MSRP.describe() # shows the statistics of the column 'MSRP'

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [ ]:
df.describe() # shows the statistics of the data frame

              Year  Engine HP  Engine Cylinders          MSRP        id
count     5.000000    4.00000          5.000000      5.000000  5.000000
mean   2010.400000  202.75000          4.400000  30186.000000  3.000000
std      11.260551   51.29896          0.894427  18985.044904  1.581139
min    1991.000000  138.00000          4.000000   2000.000000  1.000000
25%    2010.000000  180.00000          4.000000  27150.000000  2.000000
50%    2017.000000  206.00000          4.000000  32340.000000  3.000000
75%    2017.000000  228.75000          4.000000  34450.000000  4.000000
max    2017.000000  261.00000          6.000000  54990.000000  5.000000

In [72]:
df.Make.nunique() # shows the number of unique values in the column 'Make'

4

In [74]:
df.nunique() # shows the number of unique values in each column of the data frame

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        5
MSRP                 5
id                   5
dtype: int64

In [76]:
df.isnull() # shows the data frame with True where the value is null and False where the value is not null

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,False,False,False,False,False,False,False,False,False
b,False,False,False,True,False,False,False,False,False
c,False,False,False,False,False,False,False,False,False
d,False,False,False,False,False,False,False,False,False
e,False,False,False,False,False,False,False,False,False

In [78]:
df.isnull().sum() # shows the number of null values in each column of the data frame

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
id                   0
dtype: int64

Grouping

```
SELECT
    transmission_type,
    AVG(MSPR)
FROM
    cars
GROUP BY
    transmission_type
```

In [83]:
df.groupby('Transmission Type').MSRP.mean() # shows the mean of the column 'MSRP' grouped by the column 'Transmission_Type'

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

Getting the NumPy arrays

In [86]:
df.MSRP.values # shows the values of the column 'MSRP' as a numpy array

array([ 2000, 27150, 54990, 34450, 32340])

In [89]:
df.to_dict(orient='records') # convert the data frame to a list of dictionaries

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000,
  'id': 1},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'Sedan',
  'MSRP': 27150,
  'id': 2},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990,
  'id': 3},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_SUV',
  'MSRP': 34450,
  'id': 4},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Pickup',
  'MSRP': 32340,
  'id': 5}]